{
  "person_id": "kealii_reichel",
  "full_name": "Kealiʻi Reichel",
  "display_name": "Kealiʻi Reichel",
  "place_of_birth": null,
  "places_of_hawaiian_influence": [],
  "primary_influence_location": null,
  "hawaiian_speaker": null,
  "birth_date": null,
  "death_date": null,
  "cultural_background": "Native Hawaiian",
  "biographical_notes": "Born in 1962, Reichel graduated from Lahainaluna High School. He studied hula and vocals under kumu hula Pekelo Day and Pualani Kanakaʻole Kanahele. <br>Music‐career: Reichel is a singer, songwriter, and dancer (kumu hula). He formed his own hālau hula, Halau o ka Makani Wili Mākaha o Kauaʻula (later Halau Keʻalaokamaile). He became very popular in the 1990s, known for blending Hawaiian chanting with influences from mainland pop. He has won many Nā Hōkū Hanohano awards as a haku mele, performer, and producer. He has been at the forefront of the revival and perpetuation of Hawaiian culture. He is a world-class performer, best-selling recording artist, multiple award-winning kumu hula, prolific composer, renowned chanter, choreographer, dancer, crafter, scholar, and educator.<br>In 2011 he was inducted into the Hawaiian Music Hall of Fame for achievement in all facets of Hawaiian music, chant, and hula. In addition, he has received Grammy nominations for his 2004 CD Keʻalaokamaile and his 2015 release Kawaiokalena, and 36 Nā Hōkū Hanohano awards over a musical career spanning 25 years.<br>Despite critical acclaim and fame, Kealiʻi is a Kumu Hula at his core. His commitment to perpetuating his ancestor's teachings and values continues today in the lives of his students.",
  "roles": ["composer", "translator"],
  "primary_role": "composer",
  "specialties": [],
  "active_period_start": null,
  "active_period_end": null,
  "notable_works": ["E Hoʻi I Ka Pili"],
  "awards_honors": [],
  "source_references": {
    "sources": ["Pride of Punahele album"],
    "citations": []
  },
  "verification_status": "unverified",
  "last_verified_date": null
}